const iconDashboard = (
  <svg
    className="fill-current"
    width="18"
    height="18"
    viewBox="0 0 18 18"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M6.10322 0.956299H2.53135C1.5751 0.956299 0.787598 1.7438 0.787598 2.70005V6.27192C0.787598 7.22817 1.5751 8.01567 2.53135 8.01567H6.10322C7.05947 8.01567 7.84697 7.22817 7.84697 6.27192V2.72817C7.8751 1.7438 7.0876 0.956299 6.10322 0.956299ZM6.60947 6.30005C6.60947 6.5813 6.38447 6.8063 6.10322 6.8063H2.53135C2.2501 6.8063 2.0251 6.5813 2.0251 6.30005V2.72817C2.0251 2.44692 2.2501 2.22192 2.53135 2.22192H6.10322C6.38447 2.22192 6.60947 2.44692 6.60947 2.72817V6.30005Z"
      fill=""
    />
    <path
      d="M15.4689 0.956299H11.8971C10.9408 0.956299 10.1533 1.7438 10.1533 2.70005V6.27192C10.1533 7.22817 10.9408 8.01567 11.8971 8.01567H15.4689C16.4252 8.01567 17.2127 7.22817 17.2127 6.27192V2.72817C17.2127 1.7438 16.4252 0.956299 15.4689 0.956299ZM15.9752 6.30005C15.9752 6.5813 15.7502 6.8063 15.4689 6.8063H11.8971C11.6158 6.8063 11.3908 6.5813 11.3908 6.30005V2.72817C11.3908 2.44692 11.6158 2.22192 11.8971 2.22192H15.4689C15.7502 2.22192 15.9752 2.44692 15.9752 2.72817V6.30005Z"
      fill=""
    />
    <path
      d="M6.10322 9.92822H2.53135C1.5751 9.92822 0.787598 10.7157 0.787598 11.672V15.2438C0.787598 16.2001 1.5751 16.9876 2.53135 16.9876H6.10322C7.05947 16.9876 7.84697 16.2001 7.84697 15.2438V11.7001C7.8751 10.7157 7.0876 9.92822 6.10322 9.92822ZM6.60947 15.272C6.60947 15.5532 6.38447 15.7782 6.10322 15.7782H2.53135C2.2501 15.7782 2.0251 15.5532 2.0251 15.272V11.7001C2.0251 11.4188 2.2501 11.1938 2.53135 11.1938H6.10322C6.38447 11.1938 6.60947 11.4188 6.60947 11.7001V15.272Z"
      fill=""
    />
    <path
      d="M15.4689 9.92822H11.8971C10.9408 9.92822 10.1533 10.7157 10.1533 11.672V15.2438C10.1533 16.2001 10.9408 16.9876 11.8971 16.9876H15.4689C16.4252 16.9876 17.2127 16.2001 17.2127 15.2438V11.7001C17.2127 10.7157 16.4252 9.92822 15.4689 9.92822ZM15.9752 15.272C15.9752 15.5532 15.7502 15.7782 15.4689 15.7782H11.8971C11.6158 15.7782 11.3908 15.5532 11.3908 15.272V11.7001C11.3908 11.4188 11.6158 11.1938 11.8971 11.1938H15.4689C15.7502 11.1938 15.9752 11.4188 15.9752 11.7001V15.272Z"
      fill=""
    />
  </svg>
);

const iconBlog = (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="1.5em"
    height="1.5em"
    viewBox="0 0 24 24"
  >
    <path
      fill="currentColor"
      fillRule="evenodd"
      d="m18.333 10.922l-.11-.222l-.178-.14c-.235-.184-1.423.011-1.742-.278c-.228-.208-.263-.584-.33-1.09a3.15 3.15 0 0 0-.362-1.367a4.46 4.46 0 0 0-3.12-2.2H9.667a4.053 4.053 0 0 0-4.042 4.03v4.695a4.05 4.05 0 0 0 4.042 4.025h4.639a4.05 4.05 0 0 0 4.038-4.022l.02-2.675l.005-.579zM9.718 8.917h2.24a.77.77 0 0 1 0 1.541h-2.24a.77.77 0 0 1 0-1.541m4.55 6.125h-4.55a.75.75 0 1 1 0-1.5h4.55a.75.75 0 1 1 0 1.5"
      clipRule="evenodd"
      opacity="0.5"
    />
    <path
      fill="currentColor"
      d="M14.267 13.542H9.673a.75.75 0 0 0 .045 1.5h4.587a.75.75 0 0 0-.038-1.5m-4.549-3.084h2.24a.77.77 0 1 0 0-1.541h-2.24a.77.77 0 1 0 0 1.541"
    />
    <path
      fill="currentColor"
      d="M19.5 2h-15A2.5 2.5 0 0 0 2 4.5v15A2.5 2.5 0 0 0 4.5 22h15a2.5 2.5 0 0 0 2.5-2.5v-15A2.5 2.5 0 0 0 19.5 2m-1.136 9.678l-.02 2.675a4.05 4.05 0 0 1-4.038 4.022h-4.64a4.05 4.05 0 0 1-4.041-4.025V9.656a4.053 4.053 0 0 1 4.042-4.031h2.824a4.46 4.46 0 0 1 3.12 2.2c.222.422.346.89.362 1.367c.067.506.102.882.33 1.09c.32.29 1.507.094 1.742.278l.179.14l.109.222l.036.177z"
    />
  </svg>
);

const iconCareer = (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="1.5em"
    height="1.5em"
    viewBox="0 0 24 24"
  >
    <path
      fill="currentColor"
      d="M19 6H5a3 3 0 0 0-3 3v2.72L8.837 14h6.326L22 11.72V9a3 3 0 0 0-3-3"
      opacity="0.5"
    />
    <path
      fill="currentColor"
      d="M10 6V5h4v1h2V5a2 2 0 0 0-2-2h-4a2 2 0 0 0-2 2v1zm-1.163 8L2 11.72V18a3.003 3.003 0 0 0 3 3h14a3.003 3.003 0 0 0 3-3v-6.28L15.163 14z"
    />
  </svg>
);

const iconResume = (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="1.5em"
    height="1.5em"
    viewBox="0 0 24 24"
  >
    <title></title>
    <path 
      fill="currentColor"
    d="M12 21.5C10.65 20.65 8.2 20 6.5 20C4.85 20 3.15 20.3 1.75 21.05C1.65 21.1 1.6 21.1 1.5 21.1C1.25 21.1 1 20.85 1 20.6V6C1.6 5.55 2.25 5.25 3 5C4.11 4.65 5.33 4.5 6.5 4.5C8.45 4.5 10.55 4.9 12 6C13.45 4.9 15.55 4.5 17.5 4.5C18.67 4.5 19.89 4.65 21 5C21.75 5.25 22.4 5.55 23 6V20.6C23 20.85 22.75 21.1 22.5 21.1C22.4 21.1 22.35 21.1 22.25 21.05C20.85 20.3 19.15 20 17.5 20C15.8 20 13.35 20.65 12 21.5M11 7.5C9.64 6.9 7.84 6.5 6.5 6.5C5.3 6.5 4.1 6.65 3 7V18.5C4.1 18.15 5.3 18 6.5 18C7.84 18 9.64 18.4 11 19V7.5M13 19C14.36 18.4 16.16 18 17.5 18C18.7 18 19.9 18.15 21 18.5V7C19.9 6.65 18.7 6.5 17.5 6.5C16.16 6.5 14.36 6.9 13 7.5V19M14 16.35C14.96 16 16.12 15.83 17.5 15.83C18.54 15.83 19.38 15.91 20 16.07V14.57C19.13 14.41 18.29 14.33 17.5 14.33C16.16 14.33 15 14.5 14 14.76V16.35M14 13.69C14.96 13.34 16.12 13.16 17.5 13.16C18.54 13.16 19.38 13.24 20 13.4V11.9C19.13 11.74 18.29 11.67 17.5 11.67C16.22 11.67 15.05 11.82 14 12.12V13.69M14 11C14.96 10.67 16.12 10.5 17.5 10.5C18.41 10.5 19.26 10.59 20 10.78V9.23C19.13 9.08 18.29 9 17.5 9C16.18 9 15 9.15 14 9.46V11Z" />
  </svg>
);

const iconAccount = (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="1.5em"
    height="1.5em"
    viewBox="0 0 24 24"
  >
    <path
      fill="currentColor"
      d="M12 5.5A3.5 3.5 0 0 1 15.5 9a3.5 3.5 0 0 1-3.5 3.5A3.5 3.5 0 0 1 8.5 9A3.5 3.5 0 0 1 12 5.5M5 8c.56 0 1.08.15 1.53.42c-.15 1.43.27 2.85 1.13 3.96C7.16 13.34 6.16 14 5 14a3 3 0 0 1-3-3a3 3 0 0 1 3-3m14 0a3 3 0 0 1 3 3a3 3 0 0 1-3 3c-1.16 0-2.16-.66-2.66-1.62a5.54 5.54 0 0 0 1.13-3.96c.45-.27.97-.42 1.53-.42M5.5 18.25c0-2.07 2.91-3.75 6.5-3.75s6.5 1.68 6.5 3.75V20h-13zM0 20v-1.5c0-1.39 1.89-2.56 4.45-2.9c-.59.68-.95 1.62-.95 2.65V20zm24 0h-3.5v-1.75c0-1.03-.36-1.97-.95-2.65c2.56.34 4.45 1.51 4.45 2.9z"
    />
  </svg>
);
const icontImport = (
  <svg
    className="w-6 h-6 text-gray-800 dark:text-white"
    aria-hidden="true"
    xmlns="http://www.w3.org/2000/svg"
    width="24"
    height="24"
    fill="currentColor"
    viewBox="0 0 24 24"
  >
    <path
      fillRule="evenodd"
      d="M9 7V2.221a2 2 0 0 0-.5.365L4.586 6.5a2 2 0 0 0-.365.5H9Zm2 0V2h7a2 2 0 0 1 2 2v16a2 2 0 0 1-2 2H6a2 2 0 0 1-2-2v-5h7.586l-.293.293a1 1 0 0 0 1.414 1.414l2-2a1 1 0 0 0 0-1.414l-2-2a1 1 0 0 0-1.414 1.414l.293.293H4V9h5a2 2 0 0 0 2-2Z"
      clipRule="evenodd"
    />
  </svg>
);

const iconVolunteers = (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="1.5em"
    height="1.5em"
    viewBox="0 0 24 24"
  >
    <path
      fill="none"
      stroke="currentColor"
      strokeLinecap="round"
      strokeLinejoin="round"
      strokeWidth="2"
      d="M2 6s1.5-2 5-2s5 2 5 2v14s-1.5-1-5-1s-5 1-5 1zm10 0s1.5-2 5-2s5 2 5 2v14s-1.5-1-5-1s-5 1-5 1z"
    />
  </svg>
);

const iconCalenderWhite = (
  <svg
    className="w-6 h-6 text-gray-800 dark:text-white"
    aria-hidden="true"
    xmlns="http://www.w3.org/2000/svg"
    width="24"
    height="24"
    fill="currentColor"
    viewBox="0 0 24 24"
  >
    <path
      fillRule="evenodd"
      d="M5 5a1 1 0 0 0 1-1 1 1 0 1 1 2 0 1 1 0 0 0 1 1h1a1 1 0 0 0 1-1 1 1 0 1 1 2 0 1 1 0 0 0 1 1h1a1 1 0 0 0 1-1 1 1 0 1 1 2 0 1 1 0 0 0 1 1 2 2 0 0 1 2 2v1a1 1 0 0 1-1 1H4a1 1 0 0 1-1-1V7a2 2 0 0 1 2-2ZM3 19v-7a1 1 0 0 1 1-1h16a1 1 0 0 1 1 1v7a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2Zm6.01-6a1 1 0 1 0-2 0 1 1 0 0 0 2 0Zm2 0a1 1 0 1 1 2 0 1 1 0 0 1-2 0Zm6 0a1 1 0 1 0-2 0 1 1 0 0 0 2 0Zm-10 4a1 1 0 1 1 2 0 1 1 0 0 1-2 0Zm6 0a1 1 0 1 0-2 0 1 1 0 0 0 2 0Zm2 0a1 1 0 1 1 2 0 1 1 0 0 1-2 0Z"
      clipRule="evenodd"
    />
  </svg>
);

export const MENU = [
  {
    name: 'ພາບລວມ',
    path: 'dashboard',
    icon: iconDashboard,
  },
  {
    name: 'ຈັດການຂໍ້ມູນ ',
    path: 'manager',
    icon: iconBlog,
    subs: [
      {
        name: 'ຂໍ້ມູນຄົນເຈັບ',
        path: '/manager/patient',
      },
      {
        name: 'ຂໍ້ມູນພະນັກງານ',
        path: '/manager/employee',
      },
      {
        name: 'ຂໍ້ມູນປະເພດການຢາ',
        path: '/manager/category',
      },
      {
        name: 'ຂໍ້ມູນຢາ ແລະ ອຸປະກອນ',
        path: '/manager/medicines',
      },
      // {
      //   name: 'ຂໍ້ມູນອຸປະກອນ',
      //   path: '/manager/equipment',
      // },
      {
        name: 'ຂໍ້ມູນລາຍການບໍລິການ',
        path: '/manager/servicelist',
      },
   
      {
        name: 'ຂໍ້ມູນລາຍການແພັກແກັດ',
        path: '/manager/packetdetail',
      },
      {
        name: 'ຂໍ້ມູນອັດຕາແລກປ່ຽນ',
        path: '/manager/exchange',
      },
      {
        name: 'ຂໍ້ມູນພະຍາດແຂ້ວ',
        path: '/manager/disease',
      },
      {
        name: 'ຂໍ້ມູນຜູ້ສະໜອງ',
        path: '/manager/supplier',
      },
    ],
  },

  
];

export const SERVICE = [
  {
    name: 'ບໍລິການ',
    path: 'treatment',
    icon: iconVolunteers,
  },
    {
    name: 'ລາຍລະອຽດໃບບິນ',
    path: 'invoice',
    icon: iconVolunteers,
  },
    {
    name: 'ລາຍລະອຽດຊຳລະເງິນ',
    path: 'pay',
    icon: iconVolunteers,
  },
  {
    name: 'ລາຍລະອຽດ',
    path: 'patdetail',
    icon: iconResume,
  },
];
export const FOLLOW = [
  {
    name: 'ຕິດຕາມການປິ່ວປົວ',
    path: 'followpat',
    icon: iconCalenderWhite,
  },
];
export const IMPORT = [
  {
    name: 'ສັ່ງຊື່',
    path: 'perorder',
    icon: iconCareer,
  },

  {
    name: 'ນຳເຂົ້າ',
    path: 'importorder',
    icon: icontImport,
  },
];

export const REPORTALL = [
  // {
  //   name: 'Report',
  //   path: 'admin/account',
  //   icon: iconAccount,
  // },
  {
    name: 'ລາຍງານ ',
    path: 'report',
    icon: iconAccount,
    subs: [
      {
        name: 'ຂໍ້ມູນຢາ ແລະ ອຸປະກອນ',
        path: '/report/medicines',
      },
      {
        name: 'ການຊຳລະເງີນ',
        path: '/report/payments',
      },
      {
        name: 'ນັດໝາຍ',
        path: '/report/appointment',
      },
      {
        name: 'ຈ່າຍຢາ ແລະ ອຸປະກອນ',
        path: '/report/prescriptiondetail',
      },
      {
        name: 'ຕິດຕາມການປິ່ນປົວ',
        path: '/report/follow',
      },
      {
        name: 'ການນຳເຂົ້າການຢາ',
        path: '/report/import',
      },
      {
        name: 'ການສັ່ງຊື່ການຢາ',
        path: '/report/preorder',
      },
    ],
  },
];
